{
  "skills": [
    {
      "name": "Java",
      "src": "icons/java.svg",
      "description": "Extensive experience in Java, with a focus on building robust, object-oriented applications."
    },
    {
      "name": "Python",
      "src": "icons/python.svg",
      "description": "Expertise in building applications, automating tasks and performing data analysis using Python."
    },
    {
      "name": "JavaScript",
      "src": "icons/javascript.svg",
      "description": "Skilled in creating interactive and dynamic web experiences, including frontend and backend development."
    },
    {
      "name": "HTML",
      "src": "icons/html.svg",
      "description": "Experienced in using HTML to structure and create content on the internet through tags and elements."
    },
    {
      "name": "CSS",
      "src": "icons/css.svg",
      "description": "Proficient in designing and styling web content, enhancing user experiences with visually appealing layouts, colors, and typography."
    },
    {
      "name": "SASS",
      "src": "icons/sass.svg",
      "description": "Proficiency in Sass enabled me to efficiently optimize and sustain scalable CSS in web projects."
    },
    {
      "name": "React",
      "src": "icons/react.svg",
      "description": "Experienced in developing interactive and performant web applications, harnessing the power of this popular JavaScript library."
    },
    {
      "name": "Node.js",
      "src": "icons/node-js.svg",
      "description": "Used Node.js to build server-side and networking applications, "
    },
    {
      "name": "SQL",
      "src": "icons/sql.svg",
      "description": "Proficient in designing and optimizing complex database queries and structures for data-driven applications."
    },
    {
      "name": "Git",
      "src": "icons/git.svg",
      "description": "Expertise in maintaining version control for projects, ensuring collaboration and codebase integrity."
    },
    {
      "name": "Figma",
      "src": "icons/figma.svg",
      "description": "Proficient in using Figma to design user interfaces and collaborate seamlessly with teams on UX/UI projects."
    }
  ],
  "projects": [
    {
      "name": "Top Social",
      "src": "projects/top_social.png",
      "context": "A front-end social web page that prioritizes the creation of an intuitive and visually appealing user interface.",
      "link": "https://top-social.netlify.app/",
      "tools": ["HTML", "CSS", "JavaScript"]
    }, 
    {
      "name": "World Clock",
      "src": "projects/world_clock.png",
      "context": "A dynamic world clock application where the user interface seamlessly adjusts based on day and night.",
      "link": "https://world-clock-react.netlify.app/",
      "tools": ["React", "CSS", "JavaScript"]
    },
    {
      "name": "Pool Table Game",
      "src": "projects/pool_table_game.png",
      "context": "An exciting virtual pool table game project, offering an authentic and immerse billiards experience right on your screen.",
      "link": "https://github.com/JingyuChen0116/Pool_Table_Game",
      "tools": ["Java", "OOP", "JavaFX"]
    }
  ]
}